using System;

namespace CelsiusToFarenheit
{
    class Program
    {
        static void Main(string[] args)
        {
            double C = double.Parse(Console.ReadLine());
            double F = C * 1.8 + 32;

            Console.WriteLine("{0:f2}", F);
        }
    }
}
//Конзолен конвертор: от градуси °C към градуси °F
//Напишете програма, която чете градуси по скалата на Целзий(°C) и ги преобразува до градуси по скалата на
//Фаренхайт(°F). Потърсете в Интернет подходяща формула, с която да извършите изчисленията.Форматирате
//изхода до втория знак след десетичната запетая.
//°F = °C * 1.8 + 32 (формула от интернет)