using System;

namespace RadiansToDegrees
{
    class Program
    {
        static void Main(string[] args)
        {
            double rad = double.Parse(Console.ReadLine());
            double deg = rad * 180 / Math.PI; //Math.PI = числото Пи=3.14!

            Console.WriteLine(Math.Round(deg)); //Math.Round() - закръгля до цяло число
        }
    }
}
//Лице на правоъгълник в равнината
//Правоъгълник е зададен с координатите на два от своите срещуположни ъгъла(x1, y1) – (x2, y2). Да се
//пресметнат площта и периметъра му.Входът се чете от конзолата.Числата x1, y1, x2 и y2 са дадени по едно
//наред.Изходът се извежда на конзолата и трябва да съдържа два реда с по една число на всеки от тях –
//лицето и периметъра.Резултатът да се форматира до 2 знака след запетаята.